Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh44-45-v3.tmx
Source language: bo
Languages: en

source: དེ་ནས་སྦྲུལ་འཚོང་མའི་གཙོ་མོ་བལྟ་ན་སྡུག་པས། རྒྱལ་བ་གཞོན་ནུ་གཟི་བརྗིད་ཀྱི་བདག་པོ་ལ་ཚིགས་སུ་བཅད་དེ་སྨྲས་པ། །བུ་མོ་འདི་ནི་ཁྱོད་གསལ་བགྱི་སྙམ་ནས། །ཡུན་རིང་སྔ་ནས་བདག་གིས་བསམ་བསམ་སྟེ། །
en: “Then Sudarśanā, the preeminent courtesan, recited these verses to Prince Tejodhipati: “ ‘I have, for a long time, been thinking That I will give you this daughter of mine.

source: གཟུགས་མཛེས་དེ་ཡང་དེ་རིང་ཁྱོད་ལ་ཕུལ། །བསོད་ནམས་ལེགས་བརྒྱན་ཡོན་ཏན་རབ་དང་ལྡན། །
en: Today I give you this one who has a beautiful body Adorned by excellent merits and possessing excellent qualities.

source: ཚུལ་ཁྲིམས་བློ་དང་ཡོན་ཏན་གཞན་གྱིས་ཀྱང་། །བུ་མོ་དམ་པ་འདི་དང་འདྲ་བ་ནི། །མི་ཡི་འཇིག་རྟེན་གང་ནའང་མ་མཆིས་ཏེ། །
en: {80} “ ‘You will not find in the human world Another excellent girl who is like this. She has a mind of good conduct and other qualities.

source: འཇིག་རྟེན་ཀུན་གྱི་བུད་མེད་ནང་ན་མཆོག །
en: She is the best woman in all the world.

source: པད་མོའི་སྦུབས་ནས་སྐྱེས་པས་རིགས་སྨོས་སུ། །
en: {81} “ ‘Her birth was emergence from within a lotus.

source: སྐྱོན་གྱི་དྲི་མས་མ་གོས་འཐད་མ་ལགས། །
en: She is worthy, unstained by vices.

source: མ་ལུས་སྐྱོན་གྱིས་མ་གོས་སེམས་དང་ལྡན། །
en: Her mind is unblemished by any fault.

source: རྟག་པར་ཁྱོད་ཀྱི་སྤྱོད་ཚུལ་མཐུན་པར་འགྱུར། །
en: Her conduct will always be in harmony with you.

source: རེག་ན་བདེ་ལ་ཀུན་ནས་འཕགས་པས་ན། །
en: {82} “ ‘To touch her is blissful, superior to all.

source: འདི་ཡི་ལུས་ནི་ཤིན་ཏུ་འཇམ་པ་སྟེ། །
en: Her body has a perfect smoothness.

source: བྲོ་འཚལ་ནད་པ་གང་ལ་རེག་གྱུར་ཀྱང་། །དེའི་མོད་ལ་བྲོ་དང་བྲལ་བར་འགྱུར། །
en: Sick people who touch her Instantly become healthy.

source: འདིའི་ལུས་ལས་སྤོས་ཀྱི་ངད་འབྱུང་བ། །སྤོས་མཆོག་གཞན་རྣམས་མངོན་པར་ཟིལ་གྱིས་གནོན། །དེ་ཡི་དྲི་ཞིམ་མ་ཚོར་ན་རྣམ་དག་པའི། །
en: {83} “ ‘Her body exudes the aroma of perfume So perfect it overshadows all other perfumes.

source: ཚུལ་ཁྲིམས་གནས་པར་མི་རྣམས་ཀུན་ཀྱང་འགྱུར། །
en: All people who smell her lovely aroma Are established in pure, correct conduct.

source: འདི་ཡི་ལུས་ནི་གསེར་གྱི་མདོག་འདྲ་སྟེ། །པད་མོའི་མཆོག་ལྟར་རྣམ་པར་རབ་ཏུ་གསལ། །
en: {84} “ ‘Her body is like the color of gold And shines like the best of lotuses.

source: ཁྲོས་པས་བལྟས་ན་བྱམས་པའི་སེམས་ལྡན་པར། སེམས་ཅན་མ་ལུས་ཀུན་ཀྱང་རབ་ཏུ་འགྱུར། །
en: All angry beings without exception Become loving on seeing her.

source: འདི་ཡི་ཚིག་སྙན་ཡིད་དུ་འོང་བ་སྟེ། །ཉམས་སུ་བདེ་བས་འགྲོ་བ་ཉན་པར་དགའ། །
en: {85} “ ‘Her speech is sweet, beautiful, and charming So that it is a delight for beings to listen to.

source: ཐོས་ན་དེ་རྒྱུས་སྐྱོན་གྱི་མུན་པ་དང་། །མི་དགེའི་སུག་ལས་བགྱིད་པར་མོས་མི་འགྱུར། །
en: Hearing it dispels the darkness of faults And causes there to be no wish to do bad actions.

source: འདི་ནི་བསམ་དག་ཡིད་ལ་དྲི་མེད་དེ། །
en: {86} “ ‘She has pure motivation and a stainless mind.

source: འདི་ལ་ཀུན་ཏུ་གཡོ་དང་སྒྱུ་མ་མཆིས། །
en: She never has any deception or trickery.

source: ཇི་སྨྲ་དེ་དག་ཡིད་ལའང་དེ་བཞིན་ཏེ། །
en: Whatever she says, that is what is in her mind, And with her words she brings contentment to beings.

source: ཚིག་དབྱངས་དེས་ནི་འགྲོ་བ་ཚིམ་པར་བགྱིད། །སྒྱུ་ཡིས་སེམས་ཅན་འདྲིད་པར་མི་འགྱིད་དེ། །
en: {87} “ ‘She does not deceive beings through trickery.

source: ནོར་གྱི་དོན་དུ་འགྲོ་བ་ཡོངས་མི་སླུ། །
en: She does not deceive beings for the sake of wealth.

source: ཡིད་བསྡམས་ཁྲེལ་གྱིས་འཛེམ་དང་ལྡན་པ་སྟེ། །རྒན་ནམ་གཞོན་ལའང་རྟག་ཏུ་སྲིད་ཞུས་སྤྱོད། །
en: She has a sense of decorum and controls her mind, And she is always respectful to the young and the old.

source: རིགས་རྒྱུད་གཟུགས་ཀྱིས་དྲེགས་པ་མ་མཆིས་ཏེ། །
en: {88} “ ‘She is not haughty because of birth, class, or body.

source: འདི་ནི་འཁོར་གྱིས་དྲེགས་པའང་ཡོད་མ་མཆིས། །
en: She is not haughty because of her entourage.

source: ང་རྒྱལ་རློམ་སེམས་ཡོངས་དང་བྲལ་བ་སྟེ། །འགྲོ་བ་རྣམས་ལ་རྟག་ཏུ་གུས་པར་འདུད། །
en: She is free of pride and arrogance And always bows respectfully to beings.’

source: དེ་ནས་རྒྱལ་པོའི་བུ་གཟི་བརྗིད་ཀྱི་བདག་པོ་བུ་མོ་དགའ་བའི་འོད་ཀྱི་དཔལ་ཤིན་ཏུ་སྦྱངས་པ་འཁོར་དང་བཅས་པ་དང་། བུ་མོ་སྟོང་ཕྲག་ཉི་ཤུ་དང་། འཁོར་ཐམས་ཅད་དང་བཅས་པར་བཟའ་ཤིང་གི་ར་བ་སྤོས་ཀྱི་མྱུ་གུའི་རྩེ་མོ་ནས་འོད་ཀྱི་སྤྲིན་འབྱུང་བ་དེ་ནས་བྱུང་སྟེ། སྙིང་པོ་བྱང་ཆུབ་ཆོས་ཀྱིས་འཕགས་པའི་འོད་གང་ན་བ་དང་། བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་སྐུ་ཉི་མ་དམ་པ་གང་ན་བ་དེར་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་སྐུ་ཉི་མ་དམ་པའི་ཞལ་བལྟ་བ་དང་། དེ་ལ་ཕྱག་འཚལ་བ་དང་། མཆོད་པ་དང་བསྟེན་བཀུར་བྱ་བའི་ཕྱིར་དོང་སྟེ། །
en: {89} “Then Prince Tejodhipati, accompanied by the girl Sucalita­rati­prabhāsa­śrī and her entourage, and by his entourage of twenty thousand maidens, left Gandhāṅkura­śikhara­prabha­meghā Park and went to the Dharmodgata­prabhāsa bodhimaṇḍa, where the Bhagavat, the Tathāgata Sūrya­gātra­pravara, was, in order to gaze upon the Bhagavat, the Tathāgata Sūrya­gātra­pravara, bow down to him, make offerings to him, and honor him.

source: དེ་རྟ་བབས་སའི་བར་དུ་བཞོན་པས་སོང་ནས་བབས་ཏེ་རྐང་པས། བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་སྐུ་ཉི་མ་དམ་པའི་དྲུང་དུ་སོང་ངོ་། །
en: “They rode as far as the gateway and then proceeded on foot to come into the presence of the Bhagavat, the Tathāgata Sūrya­gātra­pravara.

source: དེ་ནས་རྒྱལ་པོའི་བུ་གཞོན་ནུ་གཟི་བརྗིད་ཀྱི་བདག་པོས་རྒྱང་རིང་ཞིག་ནས། བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རབ་ཏུ་བཟང་བ་བལྟ་ན་སྡུག་པ་དབང་པོ་ཞི་བ་ཐུགས་ཞི་བ། དབང་པོ་བསྡམས་པ། གླང་པོ་ལྟར་ཤིན་ཏུ་དུལ་བ། མཚོ་ལྟར་དང་ཞིང་རྙོག་པ་མེད་ལ་རྣམ་པར་གསལ་བ་མཐོང་ངོ་། །
en: “Prince Tejodhipati saw from afar that the Tathāgata Arhat Samyak­saṃbuddha Sūrya­gātra­pravara was attractive, handsome, with pacified senses, with a pacified mind, with restrained senses, as tamed as an elephant, and as clear, undefiled, and serene as a lake.

source: དེ་ལྟར་མཐོང་ནས་དེའི་སེམས་མངོན་བར་མོས་པར་གྱུར་ཏེ། དེ་ལྟར་སེམས་མངོན་པར་མོས་པར་གྱུར་ནས་སངས་རྒྱས་མཐོང་བའི་དགའ་བ་དང་།
en: “On seeing him in that way, Prince Tejodhipati was attracted to him, and with his mind attracted to him, there increased within him the power of great faith and joy on seeing the Buddha.

source: མོས་པའི་ཤུགས་ཆེན་པོ་རྣམ་པར་སྤེལ་དེ་དགའ་བ་དང་མོས་པ་དང་། སྤྲོ་པ་ཆེན་པོས་ཡོངས་སུ་རྒྱས་པའི་སེམས་ཀྱིས་བཅོམ་ལྡན་འདས་དེ་ལ་ལན་བརྒྱ་སྟོང་དུ་མར་གཡས་ཕྱོགས་སུ་བསྐོར་བ་བྱས་ནས་བུ་མོ་དགའ་བའི་འོད་ཀྱི་དཔལ་ཤིན་ཏུ་སྦྱངས་པ་ལ་སྩོགས་པ་འཁོར་ཐམས་ཅད་དང་བཅས་པས།
en: With that increasing joy, faith, and attraction, he circumambulated the Bhagavat, keeping him to his right, many hundreds of thousands of times.

source: བཅོམ་ལྡན་འདས་དེའི་ཞབས་ལ་སྤྱི་བོས་ཕྱག་འཚལ་ཏེ། རིན་པོ་ཆེ་དམ་པའི་པད་མོ་སྟོང་ཕྲག་ལྔ་བརྒྱས་བཅོམ་ལྡན་འདས་དེ་ལ་མངོན་པར་གཏོར་ཏེ།
en: “The girl Sucalita­rati­prabhāsa­śrī and the rest of the entourages bowed their heads to the Bhagavat’s feet and scattered five hundred thousand lotuses made of excellent jewels over the Bhagavat.

source: བཅོམ་ལྡན་འདས་དེའི་གཙུག་ལག་ཁང་ལྔ་བརྒྱ་ནོར་བུ་རིན་པོ་ཆེའི་རྒྱལ་པོ་སྤོས་སྣ་ཚོགས་ལས་བྱས་པ་རིན་པོ་ཆེའི་རྒྱལ་པོ་སྣ་ཚོགས་ཀྱིས་རབ་ཏུ་བརྒྱན་པ། ལྔ་བརྒྱ་བརྩིགས་སོ། །
en: They built for the Bhagavat five hundred vihāras made from various aromatic materials and kings of jewels and adorned by various kings of jewels.

source: གཙུག་ལག་ཁང་རེ་རེ་ཞིང་ཡང་ནོར་བུ་རིན་པོ་ཆེའི་རྒྱལ་པོ་སྟོང་ཕྲག་ལྔ་བརྒྱས་རབ་ཏུ་བརྒྱན་ཏོ། །
en: Each vihāra was adorned by five thousand kings of precious jewels.

source: དེ་ནས་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་སྐུ་ཉི་མ་དམ་པས་གཞོན་ནུ་གཟི་བརྗིད་ཀྱི་བདག་པོའི་བསམ་པ་ཐུགས་སུ་ཆུད་ནས་མདོ་སྡེ་སྒོ་ཀུན་ཏུ་ལྟ་བའི་སྒྲོན་མ་ཞེས་བྱ་བ་ཡང་དག་པར་བསྟན་ཏོ། །
en: “Then the Bhagavat, the Tathāgata Sūrya­gātra­pravara, knowing the thoughts of Prince Tejodhipati, taught the sūtra called The Lamp for Seeing All Entrances.

source: དེས་དེ་ཐོས་ནས་ཆོས་ཐམས་ཅད་ཀྱི་ཚུལ་ལ་ཏིང་ངེ་འཛིན་གྱི་སྒོ་རྒྱ་མཚོ་ཕྲག་བཅུ་ཐོབ་པར་གྱུར་ཏེ།
en: “When Prince Tejodhipati heard that, he attained ten oceans of samādhis of the ways of all Dharmas.

source: འདི་ལྟར་དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་སྨོན་ལམ་རྒྱ་མཚོ་ཡང་དག་པར་འབྱུང་བ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་གྱི་སྒོ་རབ་ཏུ་ཐོབ་བོ། །
en: They were like this: “He attained the gateway of the samādhi called the arising of an ocean of prayers of all the tathāgatas.

source: དུས་གསུམ་སྣང་བའི་སྙིང་པོ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་གྱི་སྒོ་རབ་ཏུ་ཐོབ་བོ། །
en: “He attained the gateway of the samādhi called the essence of the appearances of the three times.

source: སངས་རྒྱས་ཐམས་ཅད་ཀྱི་དཀྱིལ་འཁོར་མངོན་དུ་གྱུར་བར་འབྱུང་བ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་གྱི་སྒོར་རབ་ཏུ་ཐོབ་པོ། །
en: “He attained the gateway of the samādhi called the arising of the manifestation of the fields of all the buddhas.

source: སེམས་ཅན་འབྱམ་ཀླས་པ་ཐམས་ཅད་རབ་ཏུ་སྣང་བར་བྱ་བ་ལ་འཇུག་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་གྱི་སྒོ་རབ་ཏུ་ཐོབ་པོ། །
en: “He attained the gateway of the samādhi called entering the illumination of the entire vast extent of being.

source: འཇིག་རྟེན་ཐམས་ཅད་དུ་འབྱུང་བའི་ཡེ་ཤེས་ཀྱི་སྣང་བ་ལ་ཞུགས་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་གྱི་སྒོ་རབ་ཏུ་ཐོབ་པོ། །
en: “He attained the gateway of the samādhi called entering the illumination of wisdom that arises in all worlds.

source: སེམས་ཅན་ཐམས་ཅད་ཀྱི་དབང་པོ་རྒྱ་མཚོ་ལ་འཇུག་པ་སྣང་བའི་སྒྲོན་མ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་གྱི་སྒོ་རབ་ཏུ་ཐོབ་བོ། །
en: “He attained the gateway of the samādhi called the lamp that illuminates the entry into the ocean of the faculties of all beings.

source: འགྲོ་བ་ཐམས་ཅད་ཡོངས་སུ་བསྐྱབ་པའི་ཡེ་ཤེས་ཀྱི་སྤྲིན་ཅེས་བྱ་བའི་ཏིང་ངེ་འཛིན་གྱི་སྒོ་རབ་ཏུ་ཐོབ་པོ། །
en: “He attained the gateway of the samādhi called the cloud of wisdom that protects all beings.

source: འགྲོ་བ་ཐམས་ཅད་ཡོངས་སུ་སྨྱིན་པར་བྱ་བ་དང་། གདུལ་བ་ལ་མངོན་དུ་གྱུར་པའི་སྒྲོན་མ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་གྱི་སྒོ་རབ་ཏུ་ཐོབ་པོ། །
en: “He attained the gateway of the samādhi called the lamp that manifests the ripening and guiding of all beings.

source: དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་ཆོས་ཀྱི་འཁོར་ལོའི་སྒྲ་རྣམས་དམྱིགས་པར་བྱེད་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་གྱི་སྒོ་རབ་ཏུ་ཐོབ་པོ། །
en: “He attained the gateway of the samādhi called the perception of the words of the Dharma wheels of all tathāgatas.

source: ཀུན་ཏུ་བཟང་བོའི་སྤྱོད་པའི་དཀྱིལ་འཁོར་ཡོངས་སུ་དག་པར་བྱེད་པའི་སྨོན་ལམ་གྱི་སྤྲིན་ཅེས་བྱ་བའི་ཏིང་ངེ་འཛིན་གྱི་སྒོ་རབ་ཏུ་ཐོབ་སྟེ།
en: “He attained the gateway of the samādhi called the cloud of the prayers that purify the field of completely good conduct.

source: ཏིང་ངེ་འཛིན་གྱི་སྒོ་བཅུ་པོ་འདི་དག་ལ་སྩོགས་བ་ཆོས་ཀྱི་ཚུལ་ཐམས་ཅད་ལ་ཏིང་ངེ་འཛིན་གྱི་སྒོ་རྒྱ་མཚོ་ཕྲག་བཅུ་རབ་ཏུ་ཐོབ་པར་གྱུར་ཏོ། །
en: “He attained those ten samādhi gateways and so on, a further ten oceans of gateways to samādhis in all the ways of the Dharma.

source: བུ་མོ་དགའ་བའི་འོད་ཀྱི་དཔལ་ཤིན་ཏུ་སྦྱངས་པས་ཀྱང་ཡེ་ཤེས་ཐུབ་པར་དཀའ་བ་རྒྱ་མཚོའི་སྙིང་པོ་ཞེས་བྱ་བའི་སེམས་ངེས་པར་གཞག་པ་རབ་ཏུ་ཐོབ་པར་གྱུར་ཏེ། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ལས་ཀྱང་ཕྱིར་མི་ལྡོག་པར་གྱུར་ཏོ། །དེ་ནས་རྒྱལ་པོའི་བུ་གཟི་བརྗིད་ཀྱི་བདག་པོས།
en: “Also, the girl Sucalita­rati­prabhāsa­śrī attained the realization called the essence of the ocean of the wisdom that is difficult to accomplish and became irreversible in her progress to the highest, complete enlightenment.

source: བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་སྐུ་ཉི་མ་དམ་པའི་ཞབས་གཉིས་ལ་སྤྱི་བོས་ཕྱག་འཚལ་ཏེ། བཅོམ་ལྡན་འདས་ལ་ལན་བརྒྱ་སྟོང་དུ་མར་གཡས་ཕྱོགས་སུ་བསྐོར་བ་བྱས་ནས། བུ་མོ་དགའ་བའི་འོད་ཀྱི་དཔལ་ཤིན་ཏུ་སྦྱངས་པ་དང་། འཁོར་ཐམས་ཅད་དང་བཅས་ཏེ། བཅོམ་ལྡན་འདས་དེའི་སྤྱན་སྔ་ནས་དོང་ངོ་། །
en: “Then Prince Tejodhipati bowed his head to the feet of the Bhagavat, the Tathāgata Sūrya­gātra­pravara and circumambulated the Bhagavat many hundreds of thousands of times, keeping him to his right, and then, together with the girl Sucalita­rati­prabhāsa­śrī and his entourage, he departed from the presence of the Bhagavat.

source: དེ་ནས་རྒྱལ་པོའི་གནས་སྡོང་བོ་རི་བོའི་དཔལ་གང་ན་བ་དང་། རྒྱལ་པོ་ཡབ་ནོར་གྱི་བདག་པོ་གང་ན་བ་དེར་དོང་སྟེ།
en: “He went to the royal capital Druma­meru­śrī and to his father King Dhanapati.

source: དྲུང་དུ་ཕྱིན་ནས། རྒྱལ་པོ་ཡབ་ནོར་གྱི་བདག་པོའི་རྐང་པ་གཉིས་ལ་སྤྱི་བོས་ཕྱག་འཚལ་ཏེ། དོན་འདི་བརྗོད་དོ། །ལྷའི་ཞལ་སྔ་ནས་མཁྱེན་པར་མཛད་དུ་གསོལ། དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་སྐུ་ཉི་མ་དམ་པ་ཞེས་བགྱི་བ་མཁྱེན་པ་དང་ཞབས་སུ་ལྡན་པ་བདེ་བར་གཤེགས་པ་འཇིག་རྟེན་མཁྱེན་པ་བླ་ན་མེད་པ་སྐྱེས་བུ་འདུལ་བ་ཁ་ལོ་བསྒྱུར་བ།
en: He came into his presence, bowed his head to the feet of King Dhanapati, and said, ‘Your Majesty, I request that you heed me.

source: ལྷ་དང་མི་རྣམས་ཀྱི་སྟོན་པ། སངས་རྒྱས་བཅོམ་ལྡན་འདས་འཇིག་རྟེན་དུ་བྱུང་སྟེ།
en: There has appeared in the world a tathāgata, an arhat, a samyak­saṃbuddha, one with wisdom and conduct, a sugata, one who knows the world’s beings, an unsurpassable guide who tames beings, a teacher of devas and humans, a buddha, a bhagavat, named Sūrya­gātra­pravara.

source: ཁྱོད་ཀྱི་ཁམས་འདི་ཉིད་ཀྱི་སྙིང་པོ་བྱང་ཆུབ་ཆོས་ཀྱི་སྤྲིན་ཤིན་ཏུ་སྡུག་པའི་འོད་ན་རྣམ་པར་སྤྱོད་དེ།
en: He is dwelling in your realm’s bodhimaṇḍa called Dharma­meghodgata­prabhā.

source: མངོན་པར་རྫོགས་པར་སངས་རྒྱས་ནས་རིང་པོ་མ་ལགས་སོ། །
en: It is not long since he attained complete buddhahood.’

source: དེ་ནས་རྒྱལ་པོ་ནོར་གྱི་བདག་པོས། གཞོན་ནུ་གཟི་བརྗིད་ཀྱི་བདག་པོ་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །གཞོན་ནུ་ཁྱོད་ལ་དོན་འདི་ལྷ་འམ་མི་འམ་སུ་ཞིག་གི་སྦྲན།
en: “Then King Dhanapati said to Prince Tejodhipati, ‘Prince, did a deity or a human tell you about this?’

source: དེས་སྨྲས་པ། བདག་ལ་བུ་མོ་དགའ་བའི་འོད་ཀྱི་དཔལ་ཤིན་ཏུ་སྦྱངས་པས་སྦྲན་ཏོ། །
en: “He replied, ‘A girl named Sucalita­rati­prabhāsa­śrī told me.’

source: དེ་ནས་རྒྱལ་པོ་ནོར་གྱི་བདག་པོས་སངས་རྒྱས་བྱུང་བར་ཐོས་ནས། སངས་རྒྱས་སྐྱེ་བ་ལ་ནི་གཏེར་རབ་ཏུ་ཐོབ་ཙམ་དུ་སེམས།
en: “Then King Dhanapati, having heard that a buddha had appeared, thought how he had obtained the treasure of the birth of a buddha.

source: སངས་རྒྱས་རིན་པོ་ཆེ་དང་ཕྲད་པར་ནི་དཀའ་བར་སེམས།
en: He thought how it was difficult to meet a precious buddha.

source: དེ་བཞིན་གཤེགས་པ་མཐོང་བས་ནི་ངན་སོང་གི་གཡང་སའི་འཇིགས་པ་ཐམས་ཅད་ཀྱང་རྣམ་པར་ལྡོག་པར་སེམས།
en: He thought how seeing a tathāgata dispels the danger of the abyss of the lower existences.

source: ཉོན་མོངས་པའི་ནད་ཆེན་པོ་རབ་ཏུ་ཞི་བར་བྱ་བ་ལ་ནི་སྨན་པའི་རྒྱལ་པོ་ཆེན་པོ་དང་ཕྲད་པ་ཙམ་དུ་སེམས།
en: He thought how it was like encountering a great king of medicines that cures the great illness of the kleśas.

source: འཁོར་བའི་སྡུག་བསྔལ་ཐམས་ཅད་ལས་ནི་ཡོངས་སུ་འགྲེལ་བ་ཡིན་པར་སེམས།
en: He thought how this liberates from all the sufferings of saṃsāra.

source: ཤིན་ཏུ་བདེ་ཞིང་ལྡན་པ་ལ་ནི་རབ་ཏུ་གཞོག་པར་སེམས།
en: He thought how this establishes one in perfect happiness.

source: རབ་རིབ་མེད་པའི་ཡེ་ཤེས་ཀྱི་སྣང་བ་ནི་ཡང་དག་པར་སྟོན་པར་སེམས། མ་རིག་པའི་མུན་པ་བསྩལ་བ་ལ་ནི་སྒྲོན་མ་ཆེན་པོ་བྱུང་བ་ཙམ་དུ་སེམས།
en: He thought how this is a great lamp that eliminates the darkness of ignorance.

source: འཇིག་རྟེན་མགོན་མེད་པ་ལས་ནི་ཆོས་ཀྱི་ཚུལ་གྱི་མགོན་དང་ཕྲད་པར་སེམས།
en: He thought how this is like obtaining a protector in the way of the Dharma for a world that has no protector.

source: འཇིག་རྟེན་འདྲེན་པ་མེད་པ་ལས་ནི་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་ཐེག་པས་འདྲེན་པ་སྐྱེས་པར་སེམས་ཤིང་སངས་རྒྱས་བྱུང་བར་ཐོས་པས་མོས་པ་དང་།
en: He thought how this is the appearance of a guide through the yāna of omniscience for a world that has no guide.

source: སྤྲོ་བ་ཆེན་པོ་སྐྱེས་ནས་རྒྱལ་རིགས་དང་བྲམ་ཟེ་དག་ལྗོངས་ཀྱི་མི་དང་།
en: On hearing that a buddha had appeared, he felt great joy and faith.

source: ཡུལ་གྱི་མི་དང་། བློན་པོ་དང་ཞམ་རིང་བ་དང་། གཞོན་ནུ་དང་རྒྱལ་ཕྲན་དང་། ཁམས་ཀྱི་བདག་པོ་དང་། འཁོར་ཐམས་ཅད་ཀྱང་ཀུན་ནས་བསྡུས་ནས།
en: “He gathered together all the kṣatriyas, the brahmins, the townspeople, the country people, the ministers, the court priests, the princes, the local governors, the guardians, and the court.

source: སངས་རྒྱས་བྱུང་བར་སྒྲ་སྙན་པ་སྒྲོག་པའི་གཞོན་ནུ་གཟི་བརྗིད་ཀྱི་བདག་པོ་ལ་རྒྱལ་པོའི་སྲིད་དེ་ཡང་ཆོས་ཀྱི་དགབ་བར་བྱིན་ནོ། །དེ་ལྟར་གཞོན་ནུ་དེ་རྒྱལ་སྲིད་ལ་དབང་བསྐུར་ནས།
en: He bestowed the kingdom and the protection of the Dharma on Prince Tejodhipati, who had announced the appearance of the buddha.

source: སྲོག་ཆགས་སྟོང་ཕྲག་བཅུ་དང་ལྷན་ཅིག་ཏུ། བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་སྐུ་ཉི་མ་དམ་པ་གང་ན་བ་དེར་སོང་སྟེ།
en: “Having anointed him as the sovereign, he went together with two thousand people to where the Bhagavat, the Tathāgata Sūrya­gātra­pravara was.

source: སྤྱན་སྔར་ཕྱིན་ནས། བཅོམ་ལྡན་འདས་དེའི་ཞབས་གཉིས་ལ་སྤྱི་བོས་ཕྱག་འཚལ་ཏེ། བཅོམ་ལྡན་འདས་དེ་ལ་ལན་བརྒྱ་སྟོང་དུ་མར་གཡས་ཕྱོགས་སུ་བསྐོར་བ་བྱས་ནས། བཅོམ་ལྡན་འདས་དེའི་སྤྱན་སྔར་རང་གི་འཁོར་དང་བཅས་ཏེ་འཁོད་དོ། །
en: Having come into his presence, he bowed his head to the Bhagavat’s feet, circumambulated the Bhagavat, keeping him to his right, many hundreds of thousands of times, and then sat with his entourage before the Bhagavat.

source: དེ་ནས་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་སྐུ་ཉི་མ་དམ་པས། རྒྱལ་པོ་ནོར་གྱི་བདག་པོ་དང་། འཁོར་གྱི་དཀྱིལ་འཁོར་ཐམས་ཅད་ལ་གཟིགས་ནས།
en: “The Bhagavat Sūrya­gātra­pravara looked at King Dhanapati and all his entourage.

source: དེའི་ཚེ་མཛོད་སྤུ་ནས་འོད་གཟེར་འགྲོ་བ་ཐམས་ཅད་ཀྱི་སེམས་ཀྱི་སྒྲོན་མ་ཞེས་བྱ་བ་རབ་ཏུ་བཀྱེའོ། །
en: At that time his ūrṇā hair radiated a light ray called a lamp for the minds of all beings.

source: དེས་ཕྱོགས་བཅུའི་འཇིག་རྟེན་གྱི་ཁམས་སྣང་བར་བྱས་ཏེ། འཇིག་རྟེན་གྱི་དབང་པོ་ཐམས་ཅད་མངོན་སུམ་དུ་བཀོད་ནས། སངས་རྒྱས་ཀྱི་རྣམ་པར་འཕྲུལ་བ་བསམ་གྱིས་མི་ཁྱབ་པ་ཡོངས་སུ་བསྟན་ཏེ། སངས་རྒྱས་ཀྱིས་འདུལ་བའི་སེམས་ཅན་རྣམས་ཀྱི་བསམ་པ་དང་། ལྷག་པའི་བསམ་པ་རྣམ་པར་སྦྱངས་ནས།
en: It illuminated the world realms in the ten directions and came before all the lords of the worlds, manifested countless buddha miracles, and purified the thoughts and higher motivations of the beings who were being guided by the buddhas.

source: དེའི་ཚེ་སངས་རྒྱས་ཀྱི་བྱིན་གྱི་རླབས་བསམ་གྱིས་མི་ཁྱབ་པའི་མཐུས་སངས་རྒྱས་ཀྱི་སྐུ་འཇིག་རྟེན་ཐམས་ཅད་ལས་མངོན་པར་འཕགས་པ་དང་། སངས་རྒྱས་ཀྱི་གསུང་དབྱངས་ཀྱི་ཡན་ལག་རྒྱ་མཚོ་ཐམས་ཅད་དང་ལྡན་པས། གཟུངས་ཀྱི་སྒོ་ཆོས་ཐམས་ཅད་ལ་རབ་རིབ་མེད་པའི་དོན་གྱི་སྒྲོན་མ་ཞེས་བྱ་བ་གཟུངས་ཀྱི་སྒོ་སངས་རྒྱས་ཀྱི་ཞིང་གི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་སྙེད་དང་བཅས་པར་ཡང་དག་པར་བསྟན་ཏོ། །
en: “At that time, through the inconceivable blessing of the buddha, and through possessing a buddha’s body higher than all worlds, and through the entire ocean of the aspects of the voice of a buddha, he taught the dhāraṇī gateway called the lamp of the meaning of all the Dharmas freed from darkness, together with dhāraṇī gateways as numerous as the atoms in a buddha realm.

source: དེ་ནས་རྒྱལ་པོ་ནོར་གྱི་བདག་པོས་གཟུངས་ཀྱི་སྒོ་དེ་ཐོས་ནས་ཆོས་ཐམས་ཅད་ལ་ཆས་ཀྱི་སྣང་བ་ཆེན་པོ་སྐྱེས་པར་གྱུར་ཏོ། །
en: “Then King Dhanapati, having heard that dhāraṇī gateway, generated a great Dharma illumination of all Dharmas.

source: འཁོར་དེའི་བྱང་ཆུབ་སེམས་དཔལ་འཛམ་བུའི་གླིང་གི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་སྙེད་ཀྱིས་ཀྱང་ཆོས་ཐམས་ཅད་ལ་རབ་རིབ་མེད་པའི་དོན་གྱི་སྒྲོན་མའི་གཟུངས་རབ་ཏུ་ཐོབ་པར་གྱུར་ཏོ། །
en: “The bodhisattvas in that assembly, who were as numerous as the atoms in Jambudvīpa, also attained the dhāraṇī gateway called the lamp of the meaning of all the Dharmas freed from darkness.

source: ཁྲག་ཁྲིག་དྲུག་ཅུས་ནི་ཉེ་བར་ལེན་པ་མེད་པར་ཟག་པ་ལས་སེམས་ཅན་རྣམ་པར་གྲོལ་ལོ། །
en: Sixty hundred thousand million beings had their minds liberated from defilements, without grasping.

source: སྲོག་ཆགས་སྟོང་ཕྲག་བཅུས་ནི་ཆོས་རྣམས་ལ་ཆོས་ཀྱི་མིག་རྡུལ་དང་བྲལ་ཞིང་དྲི་མ་མེད་པར་རྣམ་པར་དག་པར་གྱུར་ཏོ། །
en: Ten thousand beings gained a stainless, pure, unclouded Dharma vision of all Dharmas.

source: སེམས་ཅན་གྲངས་མེད་པ་ཞིག་གིས་ནི་སྔོན་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་པ་ཡོངས་སུ་བསྐྱེད་དོ། །
en: Countless beings who had not previously developed the aspiration for the highest, complete enlightenment developed that aspiration.

source: ཕྱོགས་བཅུར་ཡང་སངས་རྒྱས་ཀྱི་རྣམ་པར་འཕྲུལ་བ་བསམ་གྱིས་མི་ཁྱབ་པ་ཡོངས་སུ་བསྟན་པ་དེས་སེམས་ཅན་གྱི་ཁམས་མཐའ་དང་དབུས་མེད་པ་ཐེག་པ་གསུམ་གྱིས་དུལ་བར་གྱུར་ཏོ། །
en: Also, the manifestation of inconceivable buddha miracles in the ten directions guided a vast extent of beings, without end or middle, by means of the three yānas.

source: དེ་ནས་རྒྱལ་པོ་ནོར་གྱི་བདག་པོ་ཆོས་ཀྱི་སྣང་བ་རབ་ཏུ་ཐོབ་པ། དེའི་ཡིད་ལ་འདི་སྙམ་སྟེ། ཁྱིམ་ན་གནས་པས་ནི་རྣམ་པ་འདི་ལྟ་བུའི་ཆོས་ཀྱང་ཁོང་དུ་ཆུད་པར་མི་ནུས་ལ་ཡེ་ཤེས་རྣམ་པ་འདི་ལྟ་བུ་ཡང་བསྒྲུབས་པར་མི་ནུས་ཀྱིས་བདག་ནི་བཅོམ་ལྡན་འདས་ཀྱི་ཞམ་རིང་དུ་རབ་ཏུ་འབྱུང་ངོ་སྙམ་ནས།
en: “Then King Dhanapati, who had attained the illumination of the Dharma, thought, ‘Living in a home, I will not be able to comprehend such a Dharma as this and will not be able to accomplish this kind of wisdom. I will enter homelessness as a servant of this bhagavat.’

source: རྒྱལ་པོ་ནོར་གྱི་བདག་པོས། བཅོམ་ལྡན་འདས་དེ་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་བདག་བཅོམ་ལྡན་འདས་ཀྱི་ཞམ་རིང་དུ་རབ་ཏུ་འབྱུང་ཞིང་བསྙེན་པར་རྫོགས་པའི་དགེ་སློང་གི་ཚུལ་ལ་མཆིས་པར་ཅི་གནང་ཞེས་ནས།
en: “King Dhanapati said to the Bhagavat, ‘Bhagavat, I wish to enter homelessness in the presence of the Bhagavat and enter the way of a complete bhikṣu.’

source: བཅོམ་ལྡན་འདས་དེས་བཀའ་སྩལ་པ། རྒྱལ་པོ་ཆེན་པོ་དེའི་དུས་ལ་དབབ་པར་ཤེས་ན་རུང་ངོ་། །
en: “The Bhagavat said, ‘Great king, you may consider that the time for that has come.’

source: དེ་ནས་རྒྱལ་པོ་ནོར་གྱི་བདག་པོ་སྲོག་ཆགས་སྟོང་ཕྲག་བཅུ་དང་ལྷན་ཅིག་ཏུ་དེ་བཞིན་གཤེགས་པ་སྐུ་ཉི་མ་དམ་པའི་ཞམ་རིང་དུ་རབ་ཏུ་བྱུང་ངོ་། །
en: “Then King Dhanapati, together with ten thousand beings, entered homelessness in the presence of the Tathāgata Sūrya­gātra­pravara.

source: དེ་ལྟར་རབ་ཏུ་བྱུང་ནས་རིང་པོ་མ་ལོན་པར་གཟུངས་ཀྱི་སྒོ་ཆོས་ཐམས་ཅད་ལ་རབ་རིབ་མེད་པའི་དོན་གྱི་སྒྲོན་མ་ཞེས་བྱ་བ་དེ་འཁོར་དང་བཅས་པར་ཡོངས་སུ་བསྒྲུབས་སོ། །བསྒོམས་སོ། །
en: Not long after entering homelessness, he accomplished the dhāraṇī gateway called the lamp of the meaning of all the Dharmas freed from darkness and its accompanying dhāraṇī gateways, meditated on them, and meditated on them well.

source: ཤིན་ཏུ་བསྒོམས་སོ། །དེ་སྙེད་ཀྱི་ཏིང་ངེ་འཛིན་གྱི་སྒོ་ཡང་རབ་ཏུ་ཐོབ་པར་གྱུར་ཏོ། །
en: He also attained many samādhi gateways.

source: བྱང་ཆུབ་སེམས་དཔའི་མངོན་པར་ཤེས་པ་བཅུ་ཡང་རབ་ཏུ་ཐོབ་བོ། །
en: He also attained the ten higher cognitions of a bodhisattva.

source: སོ་སོ་ཡང་དག་པར་རིག་པའི་ཚུལ་རྒྱ་མཚོ་ལ་ཡང་དག་པར་ཞུགས་པར་གྱུར་ཏོ། །
en: He also entered an ocean of the ways of discernment.

source: ཕྱོགས་བཅུའི་དེ་བཞིན་གཤེགས་པའི་དྲུང་དུ་འགྲོ་བ་ཐོགས་པ་མེད་པའི་སྤྱོད་ཡུལ་ཞེས་བྱ་བའི་ལུས་ཡོངས་སུ་དག་པ་ཡང་རབ་ཏུ་ཐོབ་སྟེ།
en: He also attained a pure body called the unimpeded field of activity, through which he went without impediment into the presence of the tathāgatas in the ten directions.

source: དེས་བཅོམ་ལྡན་འདས་དེའི་ཆོས་ཀྱི་འཁོར་ལོ་ཡང་དག་པར་བླངས་སོ། །ཡོངས་སུ་བཟུང་ངོ་། །གཏམ་གྱི་སྐྱེས་བུ་ཡང་བྱས་སོ། །ཆོས་སྨྲ་བ་ཆེན་པོ་ཡང་བྱས་སོ། །བསྟན་པ་ཡོངས་སུ་གཟུང་བ་ཡང་བྱས་སོ། །
en: He obtained and held the Dharma wheels of that bhagavat and spoke about them with people, and he became a great dharmabhāṇaka and was a holder of the teaching.

source: མངོན་པར་ཤེས་པ་ཐོབ་པའི་སྟོབས་ཀྱིས་ཀྱང་འཇིག་རྟེན་གྱི་ཁམས་ཐམས་ཅད་རྒྱས་པར་བཀང་སྟེ། བསམ་པ་ཇི་ལྟ་བ་བཞིན་དུ་སེམས་ཅན་རྣམས་ལ་ལུས་ཡོངས་སུ་བསྟན་ནས།
en: Through the power of attaining the higher cognitions, he spread throughout all world realms and manifested bodies to beings in accordance with their aspirations.

source: སངས་རྒྱས་བྱུང་བ་དེ་རབ་ཏུ་བརྗོད་པ་དང་། སྔོན་གྱི་དེ་བཞིན་གཤེགས་པས་ཡོངས་སུ་བསྒྲུབ་པའི་ཆོས་ཉིད་མངོན་པར་བརྗོད་པ་དང་། སྔོན་གྱི་སྦྱོར་བ་ཕུན་སུམ་ཚོགས་པ་དེ་དག་ཡོངས་སུ་བརྗོད་པ་དང་། སངས་རྒྱས་ཀྱི་རྣམ་པར་འཕྲུལ་པའི་མཐུ་དེ་དག་ཡོངས་སུ་བརྗོད་པར་བྱ་བས་བསྟན་པ་ཡོངས་སུ་གཟུང་བ་བྱས་སོ། །
en: He told them about this appearance of a buddha, told them about the nature of the accomplishments of the past tathāgatas, told them about the perfection of their past applications, described the power of the miraculous manifestations of the buddhas, and in that way was a holder of the teaching.

source: རྒྱལ་པོའི་སྲས་གཟི་བརྗིད་ཀྱི་བདག་པོས་ཀྱང་དེའི་ཉིན་པར་ཟླ་བ་ཉ་སྟེ། རྒྱས་པའི་ཚེ་རིན་པོ་ཆེ་བདུན་རབ་ཏུ་ཐོབ་པར་གྱུར་ཏེ།
en: “Prince Tejodhipati attained the seven precious possessions of a cakravartin on that very day, when the moon became full.

source: དེ་ཁང་བའི་སྟེང་ན་བུད་མེད་ཀྱི་ཚོགས་ཀྱིས་བསྐོར་ཅིང་འདུག་པའི་མདུན་དུ་འཁོར་ལོ་རིན་པོ་ཆེ་ཆེན་པོ་ཤུགས་ལ་ཐོགས་པ་མེད་པ་ཞེས་བྱ་བ་རྩིབས་སྟོང་ཕྲག་བརྒྱ་དང་ལྡན་པ་རིན་པོ་ཆེ་ཐམས་ཅད་ཀྱིས་བརྒྱན་པ། ལྷ་རྫས་ཀྱི་འཛམ་བུ་ཆུ་ཀླུང་གི་གསེར་ལས་གྲུབ་པ། འོད་ཀུན་ཏུ་འབྱུང་བ་རྣམ་པའི་མཆོག་ཐམས་ཅད་དང་ལྡན་བ་བྱུང་བར་གྱུར་ཏོ། །
en: When he was on the palace roof encircled by a gathering of women, there appeared before him a great precious wheel called Pratihatavega, which had a hundred thousand spokes, was adorned by all jewels, was made from divine Jambu River gold, was shining, and possessed every supreme feature.
